Masmiseim36/nxpSDK/boards/twrkv11z75m/project_template/pin_mux.c
/*
 * Copyright 2018 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MKV11Z128xxx7
package_id: MKV11Z128VLH7
mcu_data: ksdk2_0
processor_version: 4.0.0
board: TWR-KV11Z75M
pin_labels:
- {pin_num: '1', pin_signal: ADC1_SE12/PTE0/UART1_TX, label: 'J505[4]/UART1_TX'}
- {pin_num: '2', pin_signal: ADC1_SE13/PTE1/LLWU_P0/UART1_RX, label: 'J506[4]/UART1_RX'}
- {pin_num: '3', pin_signal: VDD3, label: 'J10[2]/VDD'}
- {pin_num: '4', pin_signal: VSS4, label: GND}
- {pin_num: '5', pin_signal: ADC0_SE1/ADC0_DP1/ADC1_SE0/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3, label: 'J9[2]/J18[5]/J22[C28]/J500[2]/ADC0_SE1/THM0P', identifier: THM0P}
- {pin_num: '6', pin_signal: ADC0_DM1/ADC0_SE5/ADC1_SE5/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, label: 'J9[4]/J18[6]/J22[C29]/J500[10]/ADC0_SE5/THM0N',
  identifier: THM0N}
- {pin_num: '7', pin_signal: ADC0_SE6/ADC1_SE1/ADC1_DP1/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA/SPI0_SIN, label: 'J7[2]/J18[7]/J22[A30]/J500[18]/ADC0_SE6/THM1P',
  identifier: THM1P}
- {pin_num: '8', pin_signal: ADC0_SE7/ADC1_SE7/ADC1_DM1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/SPI0_SOUT, label: 'J7[4]/J18[8]/J22[A28]/J500[22]/ADC0_SE7/THM1N', identifier: THM1N}
- {pin_num: '9', pin_signal: ADC0_SE0/ADC0_DP0/PTE20/FTM1_CH0/UART0_TX, label: 'J8[2]/J17[2]/J18[9]/J22[B27]/J500[35]/PTE20_INT/SW3/ADC0_SE0/THM2P', identifier: SW3;THM2P}
- {pin_num: '10', pin_signal: ADC0_SE4/ADC0_DM0/PTE21/FTM1_CH1/UART0_RX, label: 'J8[4]/J18[10]/J22[B28]/J500[12]/ADC0_SE4/THM2N', identifier: THM2N}
- {pin_num: '11', pin_signal: ADC0_SE12/PTE22, label: 'J22[A29]/ADC0_SE12'}
- {pin_num: '12', pin_signal: ADC0_SE13/PTE23, label: 'J22[B30]/ADC0_SE13/ADC1_SE13'}
- {pin_num: '13', pin_signal: VDDA, label: 'J10[2]/VDDA'}
- {pin_num: '14', pin_signal: VREFH, label: 'J10[2]/VREFH'}
- {pin_num: '15', pin_signal: VREFL, label: GND}
- {pin_num: '16', pin_signal: VSSA, label: GND}
- {pin_num: '17', pin_signal: CMP1_IN5/CMP0_IN5/PTE29/FTM0_CH2/FTM_CLKIN0, label: 'J18[12]/J22[B52]/J22[D52]/CMP0_IN5'}
- {pin_num: '18', pin_signal: ADC1_SE4/CMP1_IN4/DAC0_OUT/PTE30/FTM0_CH3/FTM_CLKIN1, label: 'J18[11]/J22[A32]/J22[B61]/J22[D61]/J500[28]/DAC0_OUT'}
- {pin_num: '19', pin_signal: ADC0_SE14/CMP0_IN4/PTE31, label: 'J22[B29]/ADC0_SE14'}
- {pin_num: '20', pin_signal: PTE24/CAN0_TX/FTM0_CH0/I2C0_SCL/EWM_OUT_b, label: 'J5[7]/U4[1]/J22[B42]/J24[13]/J500[26]/CAN0_TX'}
- {pin_num: '21', pin_signal: PTE25/LLWU_P21/CAN0_RX/FTM0_CH1/I2C0_SDA/EWM_IN, label: 'J5[5]/U4[4]/J22[B41]/J24[14]/CAN0_RX'}
- {pin_num: '22', pin_signal: PTA0/UART0_CTS_b/FTM0_CH5/EWM_IN/SWD_CLK, label: 'J24[3]/J500[29]/J523[1]/J525[4]/U512[3]/SWD_CLK'}
- {pin_num: '23', pin_signal: PTA1/UART0_RX/FTM2_CH0/CMP0_OUT/FTM2_QD_PHA/FTM1_CH1/FTM4_CH0, label: 'J22[A34]/J24[4]/J500[17]/FTM2_CH0'}
- {pin_num: '24', pin_signal: PTA2/UART0_TX/FTM2_CH1/CMP1_OUT/FTM2_QD_PHB/FTM1_CH0/FTM4_CH1, label: 'J2[2]/J22[A33]/J24[5]/J500[19]/FTM2_CH1/INT2', identifier: ACCEL_INT2}
- {pin_num: '25', pin_signal: PTA3/UART0_RTS_b/FTM0_CH0/FTM2_FLT0/EWM_OUT_b/SWD_DIO, label: 'J24[6]/J500[25]/J500[27]/J526[2]/J525[2]/U514[3]/SWD_DIO'}
- {pin_num: '26', pin_signal: PTA4/LLWU_P3/FTM0_CH1/FTM4_FLT0/FTM0_FLT3/NMI_b, label: 'J24[7]/J500[14]/SW2', identifier: SW2}
- {pin_num: '27', pin_signal: PTA5/FTM0_CH2/FTM5_FLT0, label: 'J22[B21]'}
- {pin_num: '28', pin_signal: PTA12/CAN0_TX/FTM1_CH0/FTM1_QD_PHA, label: 'J22[D9]'}
- {pin_num: '29', pin_signal: PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/FTM1_QD_PHB, label: 'J5[3]/U4[8]'}
- {pin_num: '30', pin_signal: VDD30, label: 'J10[2]/VDD'}
- {pin_num: '31', pin_signal: VSS31, label: GND}
- {pin_num: '32', pin_signal: EXTAL0/PTA18/FTM0_FLT2/FTM_CLKIN0/FTM3_CH2, label: 'Y500[3]/EXTAL0', identifier: EXTAL0}
- {pin_num: '33', pin_signal: XTAL0/PTA19/FTM0_FLT0/FTM1_FLT0/FTM_CLKIN1/LPTMR0_ALT1, label: 'Y500[1]/XTAL0', identifier: XTAL0}
- {pin_num: '34', pin_signal: PTA20/RESET_b, label: 'J22[A62]/J22[A63]/J500[4]/J512[3]/J525[10]/U515[3]/RESET'}
- {pin_num: '35', pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX, label: 'J18[17]/J22[C30]/J500[38]/ADC0_SE8'}
- {pin_num: '36', pin_signal: ADC0_SE9/ADC1_SE9/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX, label: 'J18[18]/J22[D30]/J500[20]/ADC0_SE9/ADC1_SE9'}
- {pin_num: '37', pin_signal: ADC0_SE10/ADC1_SE10/ADC1_DM2/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT1/FTM0_FLT3, label: 'J6[4]/J18[19]/J22[B62]/J24[11]/J500[37]/FTM0_FLT1/THM3N',
  identifier: THM3N}
- {pin_num: '38', pin_signal: ADC1_SE2/ADC1_DP2/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, label: 'J6[2]/J13[2]/J18[20]/J22[C27]/J24[12]/J500[39]/ADC1_SE2/INT1/THM3P',
  identifier: ACCEL_INT1;THM3P}
- {pin_num: '39', pin_signal: PTB16/UART0_RX/FTM_CLKIN2/CAN0_TX/EWM_IN, label: 'J24[9]/J500[7]/J506[2]/U512[2]/RXD0', identifier: DEBUG_UART_RX}
- {pin_num: '40', pin_signal: PTB17/UART0_TX/FTM_CLKIN1/CAN0_RX/EWM_OUT_b, label: 'J24[10]/J500[5]/J505[2]/U513[4]/TXD0', identifier: DEBUG_UART_TX}
- {pin_num: '41', pin_signal: PTB18/CAN0_TX/FTM3_CH2, label: 'J22[C38]/FTM3_CH2'}
- {pin_num: '42', pin_signal: PTB19/CAN0_RX/FTM3_CH3, label: 'J22[C37]/FTM3_CH3'}
- {pin_num: '43', pin_signal: ADC1_SE11/PTC0/SPI0_PCS4/PDB_EXTRG0/CMP0_OUT/FTM0_FLT0/SPI0_PCS0, label: 'J18[13]/J22[B46]/J500[6]/J500[33]/SPI0_PCS0/SS'}
- {pin_num: '44', pin_signal: ADC1_SE3/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FTM2_CH0, label: 'J18[14]/J22[A40]/J500[9]/U2[3]/FTM0_CH0/LED0', identifier: LED_GREEN1}
- {pin_num: '45', pin_signal: ADC0_SE11/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FTM2_CH1, label: 'J18[15]/J22[A39]/J24[15]/J500[11]/U2[4]/FTM0_CH1/LED1', identifier: LED_YELLOW1}
- {pin_num: '46', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/FTM3_FLT0, label: 'J1[1]/J18[16]/J22[A38]/J24[16]/J500[30]/U2[5]/FTM0_CH2/LED2',
  identifier: LED_GREEN2}
- {pin_num: '47', pin_signal: VSS47, label: GND}
- {pin_num: '48', pin_signal: VDD48, label: 'J10[2]/VDD'}
- {pin_num: '49', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/CMP1_OUT, label: 'J22[A37]/J24[17]/J500[32]/U2[6]/FTM0_CH3/LED3', identifier: LED_YELLOW2}
- {pin_num: '50', pin_signal: PTC5/LLWU_P9/SPI0_SCK/LPTMR0_ALT2/CMP0_OUT/FTM0_CH2, label: 'J22[B48]/J22[D7]/J24[18]/J500[31]/SPI0_SCLK'}
- {pin_num: '51', pin_signal: CMP0_IN0/PTC6/LLWU_P10/SPI0_SOUT/PDB_EXTRG1/UART0_RX/I2C0_SCL, label: 'J4[2]/J22[A7]/J22[D50]/J24[19]/J500[23]/I2C_SCL_SNSR', identifier: ACCEL_SCL}
- {pin_num: '52', pin_signal: CMP0_IN1/PTC7/SPI0_SIN/UART0_TX/I2C0_SDA, label: 'J11[2]/J22[A8]/J22[D62]/J24[20]/J500[21]/I2C_SDA_SNSR', identifier: ACCEL_SDA}
- {pin_num: '53', pin_signal: ADC1_SE14/CMP0_IN2/PTC8/FTM3_CH4, label: 'J22[D40]/FTM3_CH4'}
- {pin_num: '54', pin_signal: ADC1_SE15/CMP0_IN3/PTC9/FTM3_CH5, label: 'J22[D39]/FTM3_CH5'}
- {pin_num: '55', pin_signal: ADC1_SE16/PTC10/FTM5_CH0/FTM5_QD_PHA, label: 'J22[C34]/FTM5_CH0'}
- {pin_num: '56', pin_signal: ADC1_SE17/PTC11/LLWU_P11/FTM5_CH1/FTM5_QD_PHB, label: 'J22[C33]/FTM5_CH1'}
- {pin_num: '57', pin_signal: PTD0/LLWU_P12/SPI0_PCS0/UART0_CTS_b/FTM0_CH0/UART1_RX/FTM3_CH0, label: 'J22[C40]/J24[21]/RXD1/FTM3_CH0'}
- {pin_num: '58', pin_signal: ADC0_SE2/PTD1/SPI0_SCK/UART0_RTS_b/FTM0_CH1/UART1_TX/FTM3_CH1, label: 'J22[C39]/J24[22]/J500[40]/TXD1/FTM3_CH1'}
- {pin_num: '59', pin_signal: PTD2/LLWU_P13/SPI0_SOUT/UART0_RX/FTM0_CH2/FTM3_CH2/I2C0_SCL, label: 'J22[B45]/J22[D10]/J24[23]/SPO0_SOUT'}
- {pin_num: '60', pin_signal: PTD3/SPI0_SIN/UART0_TX/FTM0_CH3/FTM3_CH3/I2C0_SDA, label: 'J22[B44]/J22[D11]/J24[24]/SPIO_SIN'}
- {pin_num: '61', pin_signal: PTD4/LLWU_P14/SPI0_PCS1/UART0_RTS_b/FTM0_CH4/FTM2_CH0/EWM_IN/SPI0_PCS0, label: 'J22[B40]/J24[25]/J500[34]/U2[7]/FTM0_CH4/LED4', identifier: LED_GREEN3}
- {pin_num: '62', pin_signal: ADC0_SE3/PTD5/SPI0_PCS2/UART0_CTS_b/FTM0_CH5/FTM2_CH1/EWM_OUT_b/SPI0_SCK, label: 'J22[B39]/J24[26]/J500[36]/U2[8]/FTM0_CH5/LED5', identifier: LED_YELLOW3}
- {pin_num: '63', pin_signal: ADC1_SE6/PTD6/LLWU_P15/FTM4_CH0/UART0_RX/FTM0_CH0/FTM1_CH0/FTM0_FLT0/SPI0_SOUT, label: 'J22[B33]/J22[D34]/J24[27]/J500[13]/U2[9]/FTM1_CH0/LED6',
  identifier: LED_ORANGE}
- {pin_num: '64', pin_signal: PTD7/FTM4_CH1/UART0_TX/FTM0_CH1/FTM1_CH1/FTM0_FLT1/SPI0_SIN, label: 'J22[B34]/J24[28]/J500[15]/U2[10]/FTM1_CH1/LED7', identifier: LED_RED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

