Masmiseim36/nxpSDK/boards/twrkv11z75m/project_template/pin_mux.c
    const port_pin_config_t LED_GREEN3 = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as PTD4 */
                                          kPORT_MuxAsGpio};
    /* PORTD4 (pin 61) is configured as PTD4 */
    PORT_SetPinConfig(BOARD_LED_GREEN3_PORT, BOARD_LED_GREEN3_PIN, &LED_GREEN3);

    const port_pin_config_t LED_YELLOW3 = {/* Internal pull-up/down resistor is disabled */
                                           kPORT_PullDisable,
                                           /* Fast slew rate is configured */
                                           kPORT_FastSlewRate,
                                           /* Passive filter is disabled */
                                           kPORT_PassiveFilterDisable,
                                           /* Low drive strength is configured */
                                           kPORT_LowDriveStrength,
                                           /* Pin is configured as PTD5 */
                                           kPORT_MuxAsGpio};
    /* PORTD5 (pin 62) is configured as PTD5 */
    PORT_SetPinConfig(BOARD_LED_YELLOW3_PORT, BOARD_LED_YELLOW3_PIN, &LED_YELLOW3);

    const port_pin_config_t LED_ORANGE = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as PTD6 */
                                          kPORT_MuxAsGpio};
    /* PORTD6 (pin 63) is configured as PTD6 */
    PORT_SetPinConfig(BOARD_LED_ORANGE_PORT, BOARD_LED_ORANGE_PIN, &LED_ORANGE);

    const port_pin_config_t LED_RED = {/* Internal pull-up/down resistor is disabled */
                                       kPORT_PullDisable,
                                       /* Fast slew rate is configured */
                                       kPORT_FastSlewRate,
                                       /* Passive filter is disabled */
                                       kPORT_PassiveFilterDisable,
                                       /* Low drive strength is configured */
                                       kPORT_LowDriveStrength,
                                       /* Pin is configured as PTD7 */
                                       kPORT_MuxAsGpio};
    /* PORTD7 (pin 64) is configured as PTD7 */
    PORT_SetPinConfig(BOARD_LED_RED_PORT, BOARD_LED_RED_PIN, &LED_RED);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTHERMISTORsPins:
- options: {prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '5', peripheral: ADC0, signal: 'DP, 1', pin_signal: ADC0_SE1/ADC0_DP1/ADC1_SE0/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3, slew_rate: fast, pull_select: down,
    pull_enable: disable}
  - {pin_num: '6', peripheral: ADC0, signal: 'DM, 1', pin_signal: ADC0_DM1/ADC0_SE5/ADC1_SE5/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, slew_rate: fast,
    pull_select: down, pull_enable: disable}
  - {pin_num: '7', peripheral: ADC1, signal: 'DP, 1', pin_signal: ADC0_SE6/ADC1_SE1/ADC1_DP1/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA/SPI0_SIN, slew_rate: fast,
    pull_select: down, pull_enable: disable}
  - {pin_num: '8', peripheral: ADC1, signal: 'DM, 1', pin_signal: ADC0_SE7/ADC1_SE7/ADC1_DM1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/SPI0_SOUT, slew_rate: fast, pull_select: down,
    pull_enable: disable}
  - {pin_num: '9', peripheral: ADC0, signal: 'DP, 0', pin_signal: ADC0_SE0/ADC0_DP0/PTE20/FTM1_CH0/UART0_TX, identifier: THM2P, slew_rate: fast, pull_select: down,
    pull_enable: disable}
  - {pin_num: '10', peripheral: ADC0, signal: 'DM, 0', pin_signal: ADC0_SE4/ADC0_DM0/PTE21/FTM1_CH1/UART0_RX, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '38', peripheral: ADC1, signal: 'DP, 2', pin_signal: ADC1_SE2/ADC1_DP2/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, identifier: THM3P, slew_rate: fast, pull_select: down,
    pull_enable: disable}
  - {pin_num: '37', peripheral: ADC1, signal: 'DM, 2', pin_signal: ADC0_SE10/ADC1_SE10/ADC1_DM2/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT1/FTM0_FLT3, slew_rate: fast, pull_select: down,
    pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTHERMISTORsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTHERMISTORsPins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    const port_pin_config_t THM3N = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Passive filter is disabled */
                                     kPORT_PassiveFilterDisable,
                                     /* Low drive strength is configured */
                                     kPORT_LowDriveStrength,
                                     /* Pin is configured as ADC1_DM2 */
                                     kPORT_PinDisabledOrAnalog};
    /* PORTB2 (pin 37) is configured as ADC1_DM2 */
    PORT_SetPinConfig(BOARD_THM3N_PORT, BOARD_THM3N_PIN, &THM3N);

    const port_pin_config_t THM3P = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Passive filter is disabled */
                                     kPORT_PassiveFilterDisable,
                                     /* Low drive strength is configured */
                                     kPORT_LowDriveStrength,
                                     /* Pin is configured as ADC1_DP2 */
                                     kPORT_PinDisabledOrAnalog};
    /* PORTB3 (pin 38) is configured as ADC1_DP2 */
    PORT_SetPinConfig(BOARD_THM3P_PORT, BOARD_THM3P_PIN, &THM3P);

    const port_pin_config_t THM0P = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Passive filter is disabled */
                                     kPORT_PassiveFilterDisable,
                                     /* Low drive strength is configured */
                                     kPORT_LowDriveStrength,
                                     /* Pin is configured as ADC0_DP1 */
                                     kPORT_PinDisabledOrAnalog};
    /* PORTE16 (pin 5) is configured as ADC0_DP1 */
    PORT_SetPinConfig(BOARD_THM0P_PORT, BOARD_THM0P_PIN, &THM0P);

